---
kind: property
id: P:Autodesk.Revit.DB.DividedSurface.UPatternIndent
source: html/6ac8981f-2a39-db05-7cf8-0fb3ecd898f1.htm
---
# Autodesk.Revit.DB.DividedSurface.UPatternIndent Property

The offset applied to the pattern by an
integral number of grid nodes in the U-direction.

## Syntax (C#)
```csharp
public int UPatternIndent { get; set; }
```